INSERT INTO modifiers (modifier_group_id, modifier_name, additional_price, is_additional)
VALUES
-- กลุ่ม 1 : จาน/หม้อข้าว
(1, N'จานปกติ', 0, 0),
(1, N'หม้อข้าว', 40, 1),

-- กลุ่ม 2 : ระดับ / ไข่
(2, N'ปกติ', 0, 0),
(2, N'พิเศษ', 10, 0),
(2, N'ไข่ดาว', 10, 1),
(2, N'ไข่เจียว', 10, 1),
(2, N'ไข่ต้ม', 10, 1),
(2, N'ไข่ลวก', 10, 1),

-- กลุ่ม 3 : ขนาดจาน
(3, N'ปกติ', 0, 0),
(3, N'พิเศษ', 10, 0),

-- กลุ่ม 4 : ความหวาน
(4, N'125%', 0, 0),
(4, N'100%', 0, 0),
(4, N'75%', 0, 0),
(4, N'50%', 0, 0),
(4, N'25%', 0, 0),

-- กลุ่ม 5 : เนย / หน้าขนมปัง
(5, N'เนยน้ำตาล', 0, 0),
(5, N'เนยนมข้นหวาน', 0, 0),
(5, N'เนยน้ำตาลราดนม', 5, 1),
(5, N'ช็อกโกแลตดับเบิ้ล', 5, 1),

-- กลุ่ม 6 : ไอศกรีม
(6, N'ช็อกโกแลต', 0, 0),
(6, N'ชาไทย', 0, 0),
(6, N'สตรอว์เบอร์รี', 0, 0),
(6, N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 7 : ชีสดิป
(7, N'เพิ่มชีสดิป', 10, 1),

-- กลุ่ม 8 : เค้กลาวา
(8, N'ช็อกโกแลต', 0, 0),
(8, N'ชาไทย', 0, 0),
(8, N'สตรอว์เบอร์รี', 0, 0),
(8, N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 9 : เค้กหน้านิ่ม
(9, N'ช็อกโกแลต', 0, 0),
(9, N'ชาไทย', 0, 0),
(9, N'สตรอว์เบอร์รี', 0, 0),
(9, N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 10 : ปาท่องโก๋
(10, N'ไม่มีซอสจิ้ม', 0, 0),
(10, N'นมข้นหวาน', 0, 0),
(10, N'คัสตาร์ด', 5, 1),

-- กลุ่ม 11 : บัวลอย
(11, N'เพิ่มไข่', 10, 1);
