INSERT INTO dbo.modifiers (modifier_name, additional_price, is_additional)
VALUES
-- กลุ่ม 1 : จาน/หม้อข้าว
(N'จานปกติ', 0, 0),
(N'หม้อข้าว', 40, 1),

-- กลุ่ม 2 : ระดับ / ไข่
(N'ปกติ', 0, 0),
(N'พิเศษ', 10, 0),
(N'ไข่ดาว', 10, 1),
(N'ไข่เจียว', 10, 1),
(N'ไข่ต้ม', 10, 1),
(N'ไข่ลวก', 10, 1),

-- กลุ่ม 3 : ขนาดจาน
(N'ปกติ', 0, 0),
(N'พิเศษ', 10, 0),

-- กลุ่ม 4 : ความหวาน
(N'125%', 0, 0),
(N'100%', 0, 0),
(N'75%', 0, 0),
(N'50%', 0, 0),
(N'25%', 0, 0),

-- กลุ่ม 5 : เนย / หน้าขนมปัง
(N'เนยน้ำตาล', 0, 0),
(N'เนยนมข้นหวาน', 0, 0),
(N'เนยน้ำตาลราดนม', 5, 1),
(N'ช็อกโกแลตดับเบิ้ล', 5, 1),

-- กลุ่ม 6 : ไอศกรีม
(N'ช็อกโกแลต', 0, 0),
(N'ชาไทย', 0, 0),
(N'สตรอว์เบอร์รี', 0, 0),
(N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 7 : ชีสดิป
(N'เพิ่มชีสดิป', 10, 1),

-- กลุ่ม 8 : เค้กลาวา
(N'ช็อกโกแลต', 0, 0),
(N'ชาไทย', 0, 0),
(N'สตรอว์เบอร์รี', 0, 0),
(N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 9 : เค้กหน้านิ่ม
(N'ช็อกโกแลต', 0, 0),
(N'ชาไทย', 0, 0),
(N'สตรอว์เบอร์รี', 0, 0),
(N'บลูเบอร์รี', 0, 0),

-- กลุ่ม 10 : ปาท่องโก๋
(N'ไม่มีซอสจิ้ม', 0, 0),
(N'นมข้นหวาน', 0, 0),
(N'คัสตาร์ด', 5, 1),

-- กลุ่ม 11 : บัวลอย
(N'เพิ่มไข่', 10, 1);